"""Лекция 1:

1.0
1) Установите PyCharm
2) Напишите и запустите программу.которая выводит строку "Hello world!"
3) Напишите программу, которая на входе получает имя пользователя, cохраняет его
в переменную user_name и выводит строку "Hello {user_name}!"

1.1
1) Напишите программу, чтобы вывести:

** ** ** ** *
*           *
*           *
** ** ** ** *
"""

# print("Hello, world!")
#
#
user_name = input("Enter user name: ")
print(f'Hello,{user_name}!')

# print('4', '8', '15', '16', '23', '42', sep="\n")

"""Квадрат"""

print('*' * 9)
print('*', " " * 5, '*')
print('*', " " * 5, '*')
print('*' * 9)

"""Треугольник"""
# n = int(input())
# for i in range(n):
#     for j in range(i + 1):
#         print('*', end="")pythonbsb
#     print()

# n = int(input())
# for i in range(1, n):
#     print("*" * i)
